lakshveerrao/airomote/firmware/controller/sdkconfig.defaults
# ---- Aero controller (ESP32-C6) defaults. sdkconfig itself is generated; edit this file. ----
CONFIG_IDF_TARGET="esp32c6"

# Flash / partitions
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# Console over the native USB Serial/JTAG port (no external UART bridge needed)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS 1 kHz tick for millisecond scheduling
CONFIG_FREERTOS_HZ=1000

# Watchdogs / brownout
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_BROWNOUT_DET=y

# Bluetooth: NimBLE peripheral only
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=128
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=31
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y

# Smaller, faster image
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

CONFIG_BT_NIMBLE_SVC_DIS_MANUFACTURER_NAME=y

CONFIG_BT_NIMBLE_SVC_DIS_MODEL_NUMBER=y

CONFIG_BT_NIMBLE_SVC_DIS_FIRMWARE_REVISION=y

CONFIG_BT_NIMBLE_SVC_DIS_HARDWARE_REVISION=y

CONFIG_BT_NIMBLE_DIS_SERVICE=y
